In [190]:
# pi3 install jupyter
# pip3 install numpy 
# pip3 install pandas
# 启动 jupyter 
# 在工作目录下启动 jupyte notebook

# numpy 一个多维的数组，只是在原来的list上做了一些分装，提供了非常便利的科学运算功能
# pandas 侧重于数据处理，清洗
# pandas用户指南，https://pandas.pydata.org/docs/user_guide/index.html

# Shift + 回车  //执行
# all + 回车

from PO.StrPO import *
Str_PO = StrPO()
import numpy as np
import pandas as pd 
#获取默认路径
import os
print (os.path.abspath('.'))

print(1211212121)

/Users/linghuchong/Downloads/51/Python/project
1211212121

In [18]:
# a = np.array()   # 报错，选中 array() 按 shift + tab ,显示函数array参数信息，便于定位或修改。

a = np.array([1,2,3,4])

In [17]:
a

array([1, 2, 3, 4])

In [18]:
np.array([[1,2],[3,4],[5,6]])

array([[1, 2],
       [3, 4],
       [5, 6]])

In [23]:
b = np.array([[[1,2],[3,4],[5,6]]])
b.ndim  # 查看数据维度

3

In [24]:
b.dtype

dtype('int32')

In [25]:
np.arange(10)

array([0, 1, 2, 3, 4, 5, 6, 7, 8, 9])

In [26]:
np.linspace(0,2,11)

array([0. , 0.2, 0.4, 0.6, 0.8, 1. , 1.2, 1.4, 1.6, 1.8, 2. ])

In [28]:
np.random.randn(6,4)

array([[ 0.17456244,  1.11781065, -1.47141636, -0.35115272],
       [ 1.14040353,  1.34425734,  1.83383668, -0.36580451],
       [-0.14024266, -1.70936399,  0.49956777,  1.25749178],
       [-1.28500841, -0.38692749,  1.8881775 ,  0.22967062],
       [ 0.05590032,  1.00824817, -0.40479993, -1.51433327],
       [ 0.13224976,  0.56683938, -0.21911269, -0.32850995]])

In [31]:
### 【amdas 简介
# - 是一个专注于数据处理的一个库
# - 可以帮助数据分析、数据挖掘、算法工程师的人员其高耸的姐姐数据预处理的问题
###

In [33]:
# pandas 的第一个数据类型Series
obj = pd.Series([1,2,3,4,5])
obj

0    1
1    2
2    3
3    4
4    5
dtype: int64

In [34]:
obj[0]

1

In [35]:
obj[[0,2,4]]  # 注意，这里是两个括号，因为要取出来多个位置的元素时，接收的时一个list

0    1
2    3
4    5
dtype: int64

In [39]:
obj2 = pd.Series({"姓名":"张三","年龄":"12"})
obj2

姓名    张三
年龄    12
dtype: object

In [40]:
obj2["姓名"]

'张三'

In [43]:
obj2[["姓名","年龄"]]

姓名    张三
年龄    12
dtype: object

In [45]:
obj3 = pd.Series(["夏雨荷","山东",19],index=["姓名","地址","年龄"])
obj3

姓名    夏雨荷
地址     山东
年龄     19
dtype: object

In [56]:
# pandas结合这Numpy来进行数学运算
number1 = pd.Series([4,8,16,32])
np.log2(number1)  # 对数运算
a = np.log2(number1)  # 对数运算
type(a)

pandas.core.series.Series

In [55]:
# dataFrame
df1 = pd.DataFrame([["张无忌",24,"男"],["谢逊",54,"男"],["周芷若",16,"女"]])
df1

     0   1  2
0  张无忌  24  男
1   谢逊  54  男
2  周芷若  16  女

In [58]:
# 使用字典进行构造
data = {
    "人物":["张三丰","张无忌","张翠山"],
    "风景":["武当山","桃花岛","冰火岛"]
}
df2 = pd.DataFrame(data)
df2

    人物   风景
0  张三丰  武当山
1  张无忌  桃花岛
2  张翠山  冰火岛

In [59]:
df2["人物"]

0    张三丰
1    张无忌
2    张翠山
Name: 人物, dtype: object

In [60]:
df2["人物"][1]

'张无忌'

In [61]:
np_data = [["张无忌",24,"男"],["谢逊",54,"男"],["周芷若",16,"女"]]
df3 = pd.DataFrame(np_data)
df3

     0   1  2
0  张无忌  24  男
1   谢逊  54  男
2  周芷若  16  女

In [21]:
# 读取csv文件
pd.read_csv("data.csv")

    a   b   c   d   e   f
0   1   2   3   4   5   6
1  10  11  12  13  14  15

In [23]:
# 将第一行标题作为数据
pd.read_csv("data.csv", header=None)

    0   1   2   3   4   5
0   a   b   c   d   e   f
1   1   2   3   4   5   6
2  10  11  12  13  14  15

In [77]:
# 指定c这列作为索引
pd.read_csv("data.csv",index_col='c')

     a   b   d   e   f
c
3    1   2   4   5   6
12  10  11  13  14  15

In [78]:
a = pd.read_csv("data.csv",index_col='c')
type(a)

pandas.core.frame.DataFrame

In [79]:
pd.read_csv("data.csv", header=None)[0][0]

'a'

In [85]:
# 行列数
csv = pd.read_csv("data.csv")
csv.shape

(2, 6)

In [86]:
# 每一列的数据类型
csv.dtypes

a    int64
b    int64
c    int64
d    int64
e    int64
f    int64
dtype: object

In [87]:
# 显示b列的数据及类型
csv.b

0     2
1    11
Name: b, dtype: int64

In [89]:
# 数据统计性描述
csv.describe()

               a          b          c          d          e          f
count   2.000000   2.000000   2.000000   2.000000   2.000000   2.000000
mean    5.500000   6.500000   7.500000   8.500000   9.500000  10.500000
std     6.363961   6.363961   6.363961   6.363961   6.363961   6.363961
min     1.000000   2.000000   3.000000   4.000000   5.000000   6.000000
25%     3.250000   4.250000   5.250000   6.250000   7.250000   8.250000
50%     5.500000   6.500000   7.500000   8.500000   9.500000  10.500000
75%     7.750000   8.750000   9.750000  10.750000  11.750000  12.750000
max    10.000000  11.000000  12.000000  13.000000  14.000000  15.000000

In [91]:
dates = pd.date_range("20201127",periods=6)
dates

DatetimeIndex(['2020-11-27', '2020-11-28', '2020-11-29', '2020-11-30',
               '2020-12-01', '2020-12-02'],
              dtype='datetime64[ns]', freq='D')

In [93]:
# 随机生成6行4列的随机数，索引号显示dates的日期，列名显示ABCD
df = pd.DataFrame(np.random.rand(6,4),index=dates,columns=list("ABCD"))
df

                   A         B         C         D
2020-11-27  0.279630  0.104162  0.585856  0.881266
2020-11-28  0.093147  0.314897  0.867012  0.482435
2020-11-29  0.284225  0.281333  0.112428  0.226839
2020-11-30  0.342760  0.211604  0.429439  0.514805
2020-12-01  0.307594  0.923725  0.177073  0.357767
2020-12-02  0.112103  0.526397  0.369634  0.004998

In [94]:
# 转置，行列切换（与93对比一下）
df.T

   2020-11-27  2020-11-28  2020-11-29  2020-11-30  2020-12-01  2020-12-02
A    0.279630    0.093147    0.284225    0.342760    0.307594    0.112103
B    0.104162    0.314897    0.281333    0.211604    0.923725    0.526397
C    0.585856    0.867012    0.112428    0.429439    0.177073    0.369634
D    0.881266    0.482435    0.226839    0.514805    0.357767    0.004998

In [95]:
# 显示区间里的记录
df["2020-11-27":"2020-11-29"]

                   A         B         C         D
2020-11-27  0.279630  0.104162  0.585856  0.881266
2020-11-28  0.093147  0.314897  0.867012  0.482435
2020-11-29  0.284225  0.281333  0.112428  0.226839

In [96]:
# 对列进行筛选
df.loc["2020-11-27":"2020-11-29",["A","B"]]

                   A         B
2020-11-27  0.279630  0.104162
2020-11-28  0.093147  0.314897
2020-11-29  0.284225  0.281333

In [97]:
# at对行列值的选择
df.at[dates[0],"A"]

0.2796300210858449

In [100]:
df.at[dates[1],"B"]

0.3148965678468616

In [101]:
# 显示头部N条记录
df.head(2)

                   A         B         C         D
2020-11-27  0.279630  0.104162  0.585856  0.881266
2020-11-28  0.093147  0.314897  0.867012  0.482435

In [102]:
# 显示尾部N条记录
df.tail(3)

                   A         B         C         D
2020-11-30  0.342760  0.211604  0.429439  0.514805
2020-12-01  0.307594  0.923725  0.177073  0.357767
2020-12-02  0.112103  0.526397  0.369634  0.004998

In [24]:
# pandas 重新索引
obj = pd.Series([4.5,9.4,-2.3],index=["a","b","c"])
obj

a    4.5
b    9.4
c   -2.3
dtype: float64

In [107]:
# NaN表示空，表示某个索引不存在，缺省值NaN
obj_1 = obj.reindex(["a","b","c","d","e"])
obj_1

a    4.5
b    9.4
c   -2.3
d    NaN
e    NaN
dtype: float64

In [25]:
# 对缺省值设置默认值，如0
obj_1 = obj.reindex(["a","b","c","d","e"], fill_value=0)
obj_1

a    4.5
b    9.4
c   -2.3
d    0.0
e    0.0
dtype: float64

In [39]:
# 旅游网站数据清洗实战
df = pd.read_csv("icd.csv",index_col=0)   # 去掉索引
df.head()

,attachCode,name,level
mainCode,,,
A00.000,NaN,éœä¹±ï¼Œç”±äºŽO1ç¾¤éœä¹±å¼§èŒï¼Œéœä¹±ç”Ÿç‰...,NaN
A00.100,NaN,éœä¹±ï¼Œç”±äºŽO1ç¾¤éœä¹±å¼§èŒï¼ŒåŸƒå°”æ‰˜ç”...,NaN
A00.900,NaN,éœä¹±,5
A01.000,NaN,ä¼¤å¯’,5
A01.001+,K77.0*,ä¼¤å¯’æ€§è‚ç‚?5,NaN

In [28]:
df.shape

(2, 5)

In [126]:
df.info()

<class 'pandas.core.frame.DataFrame'>
Index: 23088 entries, A00.000 to I15.9
Data columns (total 3 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   attachCode  3116 non-null   object
 1   name        23088 non-null  object
 2   level       10699 non-null  object
dtypes: object(3)
memory usage: 721.5+ KB

In [136]:
df.describe()

       attachCode   name  level
count        3116  23088  10699
unique       2622  22725     34
top        G99.2*  恶性淋巴瘤      5
freq           18     13  10628

In [140]:
# 把所有的列列出来
# 注意部分列名前后有多余的空格
df.columns

Index([' attachCode ', ' name ', 'level'], dtype='object')

In [141]:
df.columns.values

array([' attachCode ', ' name ', 'level'], dtype=object)

In [29]:
col = df.columns.values
col[0].strip()

'b'

In [30]:
# 批量清除列名前后空格
df.columns = [x.strip() for x in col]
df.columns.values

array(['b', 'c', 'd', 'e', 'f'], dtype=object)

In [40]:
# 统计重复值，true表示重复
df.duplicated()

mainCode
A00.000     False
A00.100     False
A00.900     False
A01.000     False
A01.001+    False
            ...
I15.0       False
I15.1       False
I15.2       False
I15.8       False
I15.9       False
Length: 23088, dtype: bool

In [41]:
# 统计重复值的数量
df.duplicated().sum()

28

In [42]:
# 显示重复的记录
df[df.duplicated()]

,attachCode,name,level
mainCode,,,
B16.205,NaN,äºšæ€¥æ€§é‡åž‹ä¹™åž‹ç—…æ¯’æ€§è‚ç‚Žä¼´è‚æ˜è¿?5,NaN
T94.101,NaN,é™ˆæ—§æ€§å¤šéƒ¨ä½éª¨æŠ˜,5
Q93.400,NaN,æŸ“è‰²ä½?çŸ­è‡‚ç¼ºå¤±,5
J39.225,NaN,é¼»å’½æ·‹å·´ç»„ç»‡å¢žç”Ÿ,5
K46.900,NaN,è…¹ç–ï¼Œä¸ä¼´æœ‰æ¢—é˜»æˆ–åç–?5,NaN
K83.820,NaN,èƒ?å¿ƒç»¼åˆå¾,5
K86.818,NaN,èƒ?å¿ƒç»¼åˆå¾,5
G95.900,NaN,è„Šé«“ç—?5,NaN
I10.x04,NaN,é«˜è¡€åŽ?çº?5,NaN
I10.x05,NaN,é«˜è¡€åŽ?çº?5,NaN
I10.x11,NaN,å•çº¯æ”¶ç¼©æœŸé«˜è¡€åŽ?5,NaN
I45.803,NaN,é•¿QTç»¼åˆå¾?5,NaN
I77.201,NaN,åŠ¨è„‰ç˜?5,NaN
M22.900,NaN,é«Œéª¨ç–¾æ‚£,5
M25.500,NaN,å…³èŠ‚ç—?5,NaN
M43.009,NaN,è…°æ¤Žå³¡éƒ¨è£?5,NaN
M53.213,NaN,è…°æ¤Žå°å…³èŠ‚ç´Šä¹?5,NaN
G58.001,NaN,è‚‹é—´ç¥žç»ç—?5,NaN
G80.306,NaN,æ‰‹è¶³å¾åŠ¨ç—?5,NaN
Q44.601,NaN,å¤šå›Šè‚?5,NaN
Q61.300,NaN,å¤šå›Šè‚?5,NaN
C96.706,NaN,è‚¥å¤§ç»†èƒžç™½è¡€ç—?5,NaN
O36.201,NaN,èƒŽå„¿æ°´è‚¿,5
O43.807,NaN,èƒŽç›˜å›Šè‚¿,5
NaN,M96590/3,ç»“èŠ‚æ€§æ·‹å·´ç»†èƒžä¸ºä¸»åž‹éœå¥‡é‡‘ç—…,5
NaN,H06.2*,ç”²çŠ¶è…ºåŠŸèƒ½éšœç¢æ€§çªçœ?5,NaN
NaN,K67.1*,æ·‹çƒèŒæ€§è…¹è†œç‚Ž,5
NaN,M81600/3,èƒ†ç®¡ç™?5,NaN

In [50]:
# 删除重复数据（上次记录数量 Length: 23088, dtype: bool） - 重复28条， 应该是 23060
# df.drop_duplicates()  # 显示重复待删除的记录
df.drop_duplicates(inplace=True)  # 执行删除操作（不显示记录）

In [61]:
df.duplicated().sum()

0

In [62]:
df.shape

(23060, 3)

In [63]:
# 删除重复记录后，index则变成不连续
df.index

RangeIndex(start=0, stop=23060, step=1)

In [59]:
# 重新让index连续
df.index=range(df.shape[0])

In [64]:
df.index

RangeIndex(start=0, stop=23060, step=1)

In [155]:
# 处理异常值
# 旅游网站数据清洗实战
# df = pd.read_csv("tr.csv",index_col=0)   # 去掉索引
df = pd.read_csv("tr.csv")  
df

    出发地 目的地       价格    节省
0    上海  纽约  47000.0   500
1    北京  天津    300.0  7000
2    沈阳  青岛   1200.0   200
3  乌鲁木齐  拉萨    500.0  1200
4    江苏  四川   1500.0   200
5    南京  广州   1600.0  9000
6    杭州  西安      NaN   500

In [156]:
df.describe().T

    count         mean           std    min    25%     50%     75%      max
价格    6.0  8683.333333  18778.649224  300.0  675.0  1350.0  1575.0  47000.0
节省    7.0  2657.142857   3710.281725  200.0  350.0   500.0  4100.0   9000.0

In [157]:
df["价格"].std()

18778.649223697284

In [158]:
df["价格"].sum()/df["价格"].count()

8683.333333333334

In [159]:
df["价格"]-df["价格"].mean()

0    38316.666667
1    -8383.333333
2    -7483.333333
3    -8183.333333
4    -7183.333333
5    -7083.333333
6             NaN
Name: 价格, dtype: float64

In [160]:
# 数据减去平均数除以标准差的值称为“标准分数（standard score）”
sta = (df["价格"]-df["价格"].mean())/df["价格"].std()
sta

0    2.040438
1   -0.446429
2   -0.398502
3   -0.435779
4   -0.382527
5   -0.377201
6         NaN
Name: 价格, dtype: float64

In [161]:
# 数据清洗规则，对价格翻一翻的记录做清洗。
# df[sta.abs()]
df[sta.abs()>2]

  出发地 目的地       价格   节省
0  上海  纽约  47000.0  500

In [163]:
# 还有一种情况是节省>价格也是不正常的，需要清洗
df[df.节省>df.价格]

    出发地 目的地      价格    节省
1    北京  天津   300.0  7000
3  乌鲁木齐  拉萨   500.0  1200
5    南京  广州  1600.0  9000

In [164]:
# 将两种异常数据进行拼接一下，便于一起处理
pd.concat([df[sta.abs()>2],df[df.节省>df.价格]])

    出发地 目的地       价格    节省
0    上海  纽约  47000.0   500
1    北京  天津    300.0  7000
3  乌鲁木齐  拉萨    500.0  1200
5    南京  广州   1600.0  9000

In [165]:
# 获取4条记录的索引号
del_index = pd.concat([df[sta.abs()>2],df[df.节省>df.价格]]).index
del_index

Int64Index([0, 1, 3, 5], dtype='int64')

In [168]:
# 删除记录
# 删除表中的某一行或者某一列更明智的方法是使用drop，它不改变原有的df中的数据，而是可选择性的返回另一个dataframe来存放删除后的数据。
# df.drop(del_index)  # 显示删除后记录（未删除）
df.drop(del_index, inplace=True)  # 执行删除

In [169]:
df.shape

(3, 4)

In [170]:
df

  出发地 目的地      价格   节省
2  沈阳  青岛  1200.0  200
4  江苏  四川  1500.0  200
6  杭州  西安     NaN  500

# 查看缺失值
-df.isnull() 查看缺失值
-df.notnull() 查看不为空
-df.dropnd() Fillna填充缺失数据
-df.fillna()

In [171]:
df.isnull()

     出发地    目的地     价格     节省
2  False  False  False  False
4  False  False  False  False
6  False  False   True  False

In [172]:
df.isnull().sum()

出发地    0
目的地    0
价格     1
节省     0
dtype: int64

In [173]:
df.notnull()

    出发地   目的地     价格    节省
2  True  True   True  True
4  True  True   True  True
6  True  True  False  True

In [174]:
df.notnull().sum()

出发地    3
目的地    3
价格     2
节省     3
dtype: int64

In [175]:
df[df.价格.isnull()]

  出发地 目的地  价格   节省
6  杭州  西安 NaN  500

In [352]:
# 修改缺失值
df = pd.read_csv("tr.csv")  
df

   出发地  目的地       价格    节省          路线名
0   上海   纽约  47000.0   500    大连-烟台3天2晚
1   北京   天津    300.0  7000   北京-秦皇岛2天2夜
2   沈阳   青岛   1200.0   200    沈阳-青岛3天3晚
3  NaN   拉萨    500.0  1200  乌鲁木齐-拉萨2天1晚
4   江苏  NaN   1500.0   200    江苏-四川4天3夜
5   南京   广州   1600.0  9000    南京-广州6天5夜
6  NaN   西安      NaN   500    杭州-西安4天4夜

In [353]:
df[df.出发地.isnull()]

   出发地 目的地     价格    节省          路线名
3  NaN  拉萨  500.0  1200  乌鲁木齐-拉萨2天1晚
6  NaN  西安    NaN   500    杭州-西安4天4夜

In [354]:
df.loc[df.出发地.isnull(),"路线名"]

3    乌鲁木齐-拉萨2天1晚
6      杭州-西安4天4夜
Name: 路线名, dtype: object

In [355]:
[str(x).split("-")[0] for x in df.loc[df.出发地.isnull(),"路线名"]]

['乌鲁木齐', '杭州']

In [356]:
df.loc[df.出发地.isnull(),"出发地"] = [str(x).split("-")[0] for x in df.loc[df.出发地.isnull(),"路线名"]]

In [357]:
df

    出发地  目的地       价格    节省          路线名
0    上海   纽约  47000.0   500    大连-烟台3天2晚
1    北京   天津    300.0  7000   北京-秦皇岛2天2夜
2    沈阳   青岛   1200.0   200    沈阳-青岛3天3晚
3  乌鲁木齐   拉萨    500.0  1200  乌鲁木齐-拉萨2天1晚
4    江苏  NaN   1500.0   200    江苏-四川4天3夜
5    南京   广州   1600.0  9000    南京-广州6天5夜
6    杭州   西安      NaN   500    杭州-西安4天4夜

In [358]:
str(df.loc[df.目的地.isnull(),"路线名"].values)

"['江苏-四川4天3夜']"

In [359]:
# 通过正则表达式获取目的地？
re.findall("-(.*)\d天","['江苏-四川4天3夜']") 
# x[0]
# re.findall("(.*)\d",x[0])[0]

['四川']

In [360]:
str(df.loc[df.目的地.isnull(),"路线名"].values).split("-")[1]

"四川4天3夜']"

In [361]:
tmp = Str_PO.indexNumber(str(df.loc[df.目的地.isnull(),"路线名"].values).split("-")[1])
tmp

[['4', 2], ['3', 4]]

In [362]:
tmp[0][1]

2

In [363]:
[str(x).split("-")[1] for x in df.loc[df.目的地.isnull(),"路线名"]][0][:tmp[0][1]]

'四川'

In [364]:
df.loc[df.目的地.isnull(),"目的地"] = [str(x).split("-")[1] for x in df.loc[df.目的地.isnull(),"路线名"]][0][:tmp[0][1]]

In [365]:
df[df.目的地.isnull()]

Empty DataFrame
Columns: [出发地, 目的地, 价格, 节省, 路线名]
Index: []

In [366]:
df

    出发地 目的地       价格    节省          路线名
0    上海  纽约  47000.0   500    大连-烟台3天2晚
1    北京  天津    300.0  7000   北京-秦皇岛2天2夜
2    沈阳  青岛   1200.0   200    沈阳-青岛3天3晚
3  乌鲁木齐  拉萨    500.0  1200  乌鲁木齐-拉萨2天1晚
4    江苏  四川   1500.0   200    江苏-四川4天3夜
5    南京  广州   1600.0  9000    南京-广州6天5夜
6    杭州  西安      NaN   500    杭州-西安4天4夜

In [367]:
df.describe().T

    count         mean           std    min    25%     50%     75%      max
价格    6.0  8683.333333  18778.649224  300.0  675.0  1350.0  1575.0  47000.0
节省    7.0  2657.142857   3710.281725  200.0  350.0   500.0  4100.0   9000.0

In [368]:
round(df['价格'].mean(),0)

8683.0

In [369]:
# 将平均价格填充价格缺失值
df['价格'].fillna(round(df['价格'].mean(),0),inplace=True)

In [370]:
df

    出发地 目的地       价格    节省          路线名
0    上海  纽约  47000.0   500    大连-烟台3天2晚
1    北京  天津    300.0  7000   北京-秦皇岛2天2夜
2    沈阳  青岛   1200.0   200    沈阳-青岛3天3晚
3  乌鲁木齐  拉萨    500.0  1200  乌鲁木齐-拉萨2天1晚
4    江苏  四川   1500.0   200    江苏-四川4天3夜
5    南京  广州   1600.0  9000    南京-广州6天5夜
6    杭州  西安   8683.0   500    杭州-西安4天4夜

In [371]:
df["几天几夜"] = df.路线名.str.extract("(\d天\d夜)",expand=False)

In [372]:
df["几天几夜"]

0     NaN
1    2天2夜
2     NaN
3     NaN
4    4天3夜
5    6天5夜
6    4天4夜
Name: 几天几夜, dtype: object

In [374]:
df

    出发地 目的地       价格    节省          路线名  几天几夜
0    上海  纽约  47000.0   500    大连-烟台3天2晚   NaN
1    北京  天津    300.0  7000   北京-秦皇岛2天2夜  2天2夜
2    沈阳  青岛   1200.0   200    沈阳-青岛3天3晚   NaN
3  乌鲁木齐  拉萨    500.0  1200  乌鲁木齐-拉萨2天1晚   NaN
4    江苏  四川   1500.0   200    江苏-四川4天3夜  4天3夜
5    南京  广州   1600.0  9000    南京-广州6天5夜  6天5夜
6    杭州  西安   8683.0   500    杭州-西安4天4夜  4天4夜

In [375]:
df.to_csv("tr2.csv")